#密码子表↓
mima={"a":"11111",
"b":"11112",
"d":"11113",
"e":"11114",
"f":"11115",
"g":"11116",
"h":"11117",
"i":"11118",
"j":"11119",
"k":"11120",
"l":"11121",
"m":"11122",
"n":"11123",
"o":"11124",
"p":"11125",
"q":"11126",
"r":"11127",
"s":"11128",
"t":"11129",
"u":"11130",
"v":"11131",
"w":"11132",
"x":"11133",
"y":"11134",
"z":"11135",
"c":"11136",
" ":"11137"}

#反密码子表↓
fmima={"a":"11111",
"11112":"b",
"11113":"d",
"11114":"e",
"11115":"f",
"11116":"g",
"11117":"h",
"11118":"i",
"11119":"j",
"11120":"k",
"11121":"l",
"11122":"m",
"11123":"n",
"11124":"o",
"11125":"p",
"11126":"q",
"11127":"r",
"11128":"s",
"11129":"t",
"11130":"u",
"11131":"v",
"11132":"w",
"11133":"x",
"11134":"y",
"11135":"z",
"11136":"c",
"11137":" "}

#写↓
def write(mingwen,start,end):
    a=[]
    a.append('66443535323531242121245767646534676424613164646565656868684646464344576')
    a.append(start)
    for i in mingwen:
        a.append(mima[i])
    a.append(end)
    a.append('87643131353534244245468676565356565653565656565653535246465346565656')
    print(''.join(a))
    
#读取↓

def read(m,start,end):
    def f(a,b):
        n=a.find(b)
        return(n)
    miwen=m
    mingwen=[]
    starts=start
    ends=end
    start=f(miwen,starts)+5
    end=f(miwen,ends)
    while start!=end:
          s=miwen[start]+miwen[start+1]+miwen[start+2]+miwen[start+3]+miwen[start+4]
          m=fmima[s]
          mingwen.append(m)
          start=start+5
    print(''.join(mingwen))
    
    